app/controllers/listings_controller.rb

  def seller
    @listings = Listing.where(user: current_user).order("created_at DESC")
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 2  ORDER BY created_at DESC

  def index
    @listings = Listing.all.order("created_at DESC")
---
SELECT "listings".* FROM "listings"  ORDER BY created_at DESC

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test "], ["description", "This is a test"], ["price", 10.0], ["created_at", "2017-07-11 15:14:33.739890"], ["updated_at", "2017-07-11 15:14:33.739890"]]

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "description" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = ?