app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."seller_id" = 2  ORDER BY created_at DESC
---
  def sales
    @orders = Order.all.where(seller: current_user).order("created_at DESC")

SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 2  ORDER BY created_at DESC
---
  def purchases
    @orders = Order.all.where(buyer: current_user).order("created_at DESC")

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 4]]
---
  def new
    @order = Order.new
    @listing = Listing.find(params[:listing_id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "orders" ("address", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "123"], ["city", "LA"], ["state", "CA"], ["created_at", "2017-07-13 07:16:30.528963"], ["updated_at", "2017-07-13 07:16:30.528963"]]
---
  def create
    @order = Order.new(order_params)
    @listing = Listing.find(params[:listing_id])
    @seller = @listing.user

    @order.listing_id = @listing.id
    @order.buyer_id = current_user.id
    @order.seller_id = @seller.id

    respond_to do |format|
      if @order.save